brew 'autossh'
brew 'awscli'
brew 'bat'
brew 'cmake' # Neovim dependency
brew 'eza'
brew 'fd'
brew 'fswatch' # Neovim dependency
brew 'fzf'
brew 'gettext' # Neovim dependency
brew 'git-delta'
brew 'go'
brew 'gradle'
brew 'homerow'
brew 'jq'
brew 'maven'
brew 'ninja' # Neovim dependency
brew 'node@20', link: true
brew 'node@22'
brew 'pre-commit'
brew 'ripgrep'
brew 'ruby'
brew 'rust'
brew 'sesh'
brew 'starship'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'uv'
brew 'vim'
brew 'vivid'
brew 'wget'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

if RUBY_PLATFORM =~ /darwin/
  cask 'font-hack-nerd-font'
  cask 'font-jetbrains-mono-nerd-font'
  cask 'font-mononoki-nerd-font'

  cask 'alcove'
  cask 'docker'
  cask 'hammerspoon'
  cask 'jordanbaird-ice'
  cask 'karabiner-elements'
  cask 'raycast'
  cask 'rocket'
  cask 'sf-symbols'
  cask 'wezterm@nightly'

  brew 'imagemagick'

  tap 'FelixKratz/formulae'
  brew 'borders'
end
