brew 'bat'
brew 'go'
brew 'gradle'
brew 'maven'
brew 'neovim', args: ['HEAD']
brew 'ninja'
brew 'node@12'
brew 'node@14', link: true
brew 'pure'
brew 'ripgrep'
brew 'ruby'
brew 'rust'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

if RUBY_PLATFORM =~ /darwin/
  tap 'homebrew/cask-fonts'
  cask 'font-hack-nerd-font'

  cask 'alfred'
  cask 'docker'
  cask 'kitty'
  cask 'monitorcontrol'
  cask 'rectangle'
  cask 'stats'

  brew 'awscli'
  brew 'openjdk'
end
