brew 'bat'
brew 'fd'
brew 'go'
brew 'gradle'
brew 'jq'
brew 'maven'
brew 'neovim', args: ['HEAD']
brew 'node@14', link: true
brew 'pure'
brew 'ripgrep'
brew 'ruby'
brew 'rust'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

if RUBY_PLATFORM =~ /darwin/
  tap 'homebrew/cask-fonts'
  cask 'font-hack-nerd-font'
  cask 'font-jetbrains-mono-nerd-font'

  tap 'FelixKratz/formulae'
  brew 'sketchybar'

  cask 'alfred'
  cask 'docker'
  cask 'hammerspoon'
  cask 'karabiner-elements'
  cask 'kitty'
  cask 'monitorcontrol'

  brew 'awscli'
  brew 'imagemagick'
  brew 'openjdk'
  brew 'koekeishiya/formulae/yabai'
end
